In [1]:
import csv
import pandas as pd
import datetime as dt

In [2]:
path = "Resources/Seattle_calendar.csv"

In [3]:
df1 = pd.read_csv(path)

In [4]:
df1.head()

   listing_id        date available    price
0      103908  2019-08-07         t  $200.00
1      103908  2019-08-06         t  $200.00
2      103908  2019-08-05         t  $200.00
3      103908  2019-08-04         t  $200.00
4      103908  2019-08-03         t  $209.00

In [5]:
df1 = df1.sort_values(by="date",ascending= True)

In [6]:
df1.head()

         listing_id        date available   price
3190099    29929168  2018-11-15         f     NaN
1392775    16389086  2018-11-15         f     NaN
1392824    16602889  2018-11-15         t  $79.00
1392840    16894346  2018-11-15         f     NaN
2898018    27486354  2018-11-15         t  $65.00

In [7]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [8]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [9]:
df2.head()

         listing_id       date available   price
3190099    29929168 2018-11-15         f     NaN
1392775    16389086 2018-11-15         f     NaN
1392824    16602889 2018-11-15         t  $79.00
1392840    16894346 2018-11-15         f     NaN
2898018    27486354 2018-11-15         t  $65.00

In [10]:
today_dt = dt.date.today()
today = dt.datetime.strftime(today_dt, '%Y-%m-%d')

#extract year, month, and day as integers
todayYear = int(dt.datetime.strftime(today_dt, '%Y'))
todayMonth = int(dt.datetime.strftime(today_dt, '%m'))
todayDay = int(dt.datetime.strftime(today_dt, '%d'))


week_later_dt = dt.date(todayYear, todayMonth, todayDay) + dt.timedelta(days=8)
week_later = dt.datetime.strftime(week_later_dt, '%Y-%m-%d')
week_later

'2018-12-29'

In [11]:
df2 = df2.loc[(df2['date']>=today) & (df2['date']<week_later) & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
25232        443942 2018-12-21         t  $180.00
2882270    27809933 2018-12-21         t  $139.00
2214748    22210613 2018-12-21         t  $228.00
2858873    27345331 2018-12-21         t  $187.00
3147326    29334499 2018-12-21         t  $139.00

In [12]:
df2['price'].value_counts().head()
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
dtype: object

In [13]:
df2["new_price"] = df2["price"].str.strip('$')

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
df2["new_price"] = pd.to_numeric(df2["new_price"],errors='coerce')

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [15]:
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
new_price            float64
dtype: object

In [16]:

bins = [0, 50, 100, 150, 200, 250]

# Create the names for the four bins
group_names = ["Under $50", "$50-100", "$100-150", "$150-200", "$200-250"]

df2["price"] = pd.cut(df2["new_price"], bins, labels=group_names)

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys

In [17]:
# today_dt
under_50 = []
fifty_100 = []
hundred_150 = []
onefifty_200 = []
twohundred_250 = []

numdays = 8
date_list = [today_dt + dt.timedelta(days=x) for x in range(0, numdays)]

date_list = [dt.datetime.strftime(i, '%Y-%m-%d') for i in date_list]
date_list

for i in date_list:
    prices = df2.loc[df2["date"] == i, "price"].value_counts()
    under_50.append(prices[0])
    fifty_100.append(prices[1])
    hundred_150.append(prices[2])
    onefifty_200.append(prices[3])
    twohundred_250.append(prices[4])

In [18]:
df3 = pd.DataFrame({"Date": date_list, 
                     "Under $50": under_50, 
                     "$50-100": fifty_100, 
                     "$100-150": hundred_150,
                     "$150-200": onefifty_200,
                     "$200-250": twohundred_250
                    })
df3
Seattle_airbnb = df3
# df3.set_index("Date")

In [19]:
Seattle_airbnb

         Date  Under $50  $50-100  $100-150  $150-200  $200-250
0  2018-12-21        384     1360      1223       558       282
1  2018-12-22        357     1268      1051       571       277
2  2018-12-23        375     1166       982       531       285
3  2018-12-24        355     1119       977       545       282
4  2018-12-25        342     1095       958       532       286
5  2018-12-26        353     1145       981       540       310
6  2018-12-27        362     1148       930       565       327
7  2018-12-28        330     1057       946       543       386